Autodesk.Revit.DB.FormattedTextRun
A structure that defines a single run of a formated text.
Remarks:
A text run identifies a segment of text content with formatting style that
does not change for the entire run. In other words, text runs are separated by
differences in formatting. However, runs are also separated by tabulators and
line-ends, which means that any multi-line text will have number of runs equal
or higher than the number of lines even if the text itself has uniform formatting throughout.
A collection of text runs can be obtained from a Autodesk::Revit::DB::TextNode
by calling Autodesk::Revit::DB::TextNode::GetTextRuns.
See also: Autodesk::Revit::DB::IModelExportContext::OnText
for more details about text output during custom exports.
Since:
2016